Ran Plan for dir: `terraform/atlantis` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # kubernetes_namespace.mongodb has been changed
~ resource "kubernetes_namespace" "mongodb" {
        id = "mondodb"

      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "mondodb"
            # (3 unchanged attributes hidden)
        }
    }
  # kubernetes_secret.tls has been deleted
- resource "kubernetes_secret" "tls" {
      - data      = (sensitive value)
      - id        = "argocd/wayofthesys-com-argocd-tls" -> null
      - immutable = false -> null
      - type      = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "wayofthesys-com-argocd-tls" -> null
          - namespace        = "argocd" -> null
          - resource_version = "3068095" -> null
          - uid              = "664c5a11-a6a5-43ed-9a46-9ff48fdb7480" -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.mongodb will be created
+ resource "helm_release" "mongodb" {
      + atomic                     = false
      + chart                      = "mongodb"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "mongodb"
      + namespace                  = "mongodb"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "11.0.6"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_namespace.pritunl will be created
+ resource "kubernetes_namespace" "pritunl" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "pritunl"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.tls will be created
+ resource "kubernetes_secret" "tls" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "wayofthesys-com-pritunl-tls"
          + namespace        = "pritunl"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # tls_cert_request.request must be replaced
-/+ resource "tls_cert_request" "request" {
      ~ cert_request_pem = <<-EOT
            -----BEGIN CERTIFICATE REQUEST-----
            MIIDBDCCAewCAQAwNDERMA8GA1UEChMIQXRsYW50aXMxHzAdBgNVBAMTFmFyZ29j
            ZC53YXlvZnRoZXN5cy5jb20wggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
            AQDmUkNgCTSDgLGQkK7pqaAIBnYhJ3uu+y68Yk0/6H8FL/o3VW0PG42b+RWRQZEc
            n6GOAMjyHRzwH1XnMmxBV/++iGVgUN/PKyIwTSHB6PJeJo9p5IxfRVlFSpUYE0bT
            z8wjAadyiAZq7xGTnNegXu0EeMg8yVTmg2istL3kx+XkWoL9TPaQBE0Fw88+lumC
            Rv1onKY+AhB/1yYipeqVdB6w0y54LIuVc2DLqT25osThOWKE1SFQ6EqmlP46L+Mo
            Jj62y/n663Oik+KYl5v3QT7l+ujFECMoyUnQxb7QMdOqxkPaCeY/CdpFnvfCZret
            kyZQKtZ2A0IDZyi/+FJFTLwbAgMBAAGggYowgYcGCSqGSIb3DQEJDjF6MHgwdgYD
            VR0RBG8wbYIIYXRsYW50aXOCDmF0bGFudGlzLmxvY2FsgiJhdGxhbnRpcy5kZWZh
            dWx0LnN2Yy5jbHVzdGVyLmxvY2Fsgglsb2NhbGhvc3SCFmFyZ29jZC53YXlvZnRo
            ZXN5cy5jb22HBH8AAAGHBIrFMPcwDQYJKoZIhvcNAQELBQADggEBAMVNHF+Q52Bv
            hOXdvVs0S0Tp45czwq39274bX79x+JW/GhlszmPZP0YufiGQadRc6qckJhKK412P
            ot47D4fx0+ButT04L7JdR/MI4XuU5jTrJhorZsWJWBeLZh1qMdaXRJXHHbCj25L0
            ebGi1McpHmDceCX+uQNVEtEVH+SdQKE0oxdiTsuOV+M5IlphkjY0e9Y2K7mrEVC4
            lbeoJBeIHFHWxW5Qw2ehLai/5fjDOs4kZMHKGA6vCrUw3Il8eDCQy0JpvDAooL0m
            znP5uCKi2TqtEvQU934crB1QXv6iQ2RFzjI60ydQ3Lv+wqyCGtjiVVSsB1/FLHp2
            LToxQUVijac=
            -----END CERTIFICATE REQUEST-----
        EOT -> (known after apply)
      ~ dns_names        = [ # forces replacement
            # (3 unchanged elements hidden)
            "localhost",
          - "argocd.wayofthesys.com",
          + "pritunl.wayofthesys.com",
        ]
      ~ id               = "caa3bdf3c3c91212d4882d9dc39ef9a3b5450840" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ subject {
          - street_address = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # tls_locally_signed_cert.cert must be replaced
-/+ resource "tls_locally_signed_cert" "cert" {
      ~ ca_cert_pem           = "cca4606e6b9364197e808d350f214f2f00852a78" -> (known after apply) # forces replacement
      ~ cert_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDvjCCAqagAwIBAgIQd6HtGGhngPfEVzpbcUyhczANBgkqhkiG9w0BAQsFADAm
            MREwDwYDVQQKEwhBdGxhbnRpczERMA8GA1UEAxMIY2EubG9jYWwwHhcNMjIwMzA1
            MjIyMjIzWhcNMjMwMzA1MjIyMjIzWjA0MREwDwYDVQQKEwhBdGxhbnRpczEfMB0G
            A1UEAxMWYXJnb2NkLndheW9mdGhlc3lzLmNvbTCCASIwDQYJKoZIhvcNAQEBBQAD
            ggEPADCCAQoCggEBAOZSQ2AJNIOAsZCQrumpoAgGdiEne677LrxiTT/ofwUv+jdV
            bQ8bjZv5FZFBkRyfoY4AyPIdHPAfVecybEFX/76IZWBQ388rIjBNIcHo8l4mj2nk
            jF9FWUVKlRgTRtPPzCMBp3KIBmrvEZOc16Be7QR4yDzJVOaDaKy0veTH5eRagv1M
            9pAETQXDzz6W6YJG/Wicpj4CEH/XJiKl6pV0HrDTLngsi5VzYMupPbmixOE5YoTV
            IVDoSqaU/jov4ygmPrbL+frrc6KT4piXm/dBPuX66MUQIyjJSdDFvtAx06rGQ9oJ
            5j8J2kWe98Jmt62TJlAq1nYDQgNnKL/4UkVMvBsCAwEAAaOB2TCB1jAOBgNVHQ8B
            Af8EBAMCAqQwHQYDVR0lBBYwFAYIKwYBBQUHAwIGCCsGAQUFBwMBMAwGA1UdEwEB
            /wQCMAAwHwYDVR0jBBgwFoAUiX7mn7B4BkrbgISk8XecJhMj9owwdgYDVR0RBG8w
            bYIIYXRsYW50aXOCDmF0bGFudGlzLmxvY2FsgiJhdGxhbnRpcy5kZWZhdWx0LnN2
            Yy5jbHVzdGVyLmxvY2Fsgglsb2NhbGhvc3SCFmFyZ29jZC53YXlvZnRoZXN5cy5j
            b22HBH8AAAGHBIrFMPcwDQYJKoZIhvcNAQELBQADggEBABLAb6JEf8yqwY3D7s3g
            iJKxaqNhWg9UuAbi0/rkYrLSXUwZiYtC8epg+3hpQW1V51guuadjeEayuYUsoUdj
            9NHnV48P7Z7O/mZHT59iyrUzO0Nc0maEN9DIN4LgeCaCm3N9RBxePLlfOqTUaoB9
            Kpuib3olgZwd1RwY6MKxI5P2b9a5gL1jvr77PbKo7FnF9C/XOU5gtT8pskJZxoL/
            vXuIyFa90tzUe5WhAGhtIqw60HzGalG/RTw27iF6tEem1B4Bm1Um5iW9/gLiRo9E
            oxkigtPk51FM2n945au3wIszpAFKGv6+aGPYGi7b+yV5kBkw8vTUZ218AxXld/E4
            dE4=
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ cert_request_pem      = "54613bc3db29ed77732104a45192b2232e5b1f60" -> (known after apply) # forces replacement
      ~ id                    = "159018900157492631326224656218018586995" -> (known after apply)
      ~ ready_for_renewal     = false -> true
      ~ validity_end_time     = "2023-03-05T22:22:23.987541982Z" -> (known after apply)
      ~ validity_start_time   = "2022-03-05T22:22:23.987541982Z" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # tls_self_signed_cert.ca must be replaced
-/+ resource "tls_self_signed_cert" "ca" {
      ~ cert_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDGDCCAgCgAwIBAgIQLQNVYInNsRg7dgw1seUGNjANBgkqhkiG9w0BAQsFADAm
            MREwDwYDVQQKEwhBdGxhbnRpczERMA8GA1UEAxMIY2EubG9jYWwwHhcNMjIwMzA1
            MjIyMjIzWhcNMjMwMzA1MjIyMjIzWjAmMREwDwYDVQQKEwhBdGxhbnRpczERMA8G
            A1UEAxMIY2EubG9jYWwwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQDc
            fPPIaxPWZOSAuR8v92BUmSSw2+gKe3pwSy463fJpfnxBBB0RoANQGKCxVtFi632n
            rGpcG9yK8ssLP92ZdcFRQppYj28i9HNDIPAy0f7Sghakpeawkw04wBrqz5V9vKUn
            NeCa+6F2DqtAh6B4AxtVDwPOTL98EtrcE9pL/Z61bXmJcERiKisz+G/2qxO+Qdqd
            ZlBY1IyiYeilLzDrbQIse/aO/4FEkWk70rg0lGYcSpEc0+9gUqBQe9yBQnx76yJF
            mdMEkZ4o+t8xdX7wyZb0BwnU7Mh51jkFkBKQZXg6f2lN9hxrxahpYkCv/n1fIvX8
            wahWMdtFCm/kvD0Aavu7AgMBAAGjQjBAMA4GA1UdDwEB/wQEAwICpDAPBgNVHRMB
            Af8EBTADAQH/MB0GA1UdDgQWBBSJfuafsHgGStuAhKTxd5wmEyP2jDANBgkqhkiG
            9w0BAQsFAAOCAQEAlsyajIXJdznWU1QfFOcw0/Q9QRbaekR46fUcNelB3FlMRgeF
            j27HBxNDUmYA1D+4mrKSkJMmN4iZrILYEOY/nbSpxMwOGm0023nadGmZ9Hy0SLLM
            aV7ZK5Kz8MFD0ULxlB2bT3tH3mcQNaXI5VoLEulpXU1Y5qqXifELrL/9rZWF5YjE
            27jFd8viw167YpTtZLmumFbb3dkhcnBR7cGO/zRNE2T2bH/J/r8iPHO9NEcXlatV
            LkTYceKKqiZKvcd0Tl/w5AE+x0fKT+0o+LTnu+5qUZFQNEUfe/AoPuiMGLBtWaSy
            guUUO6l/SDrJBa8LDMYE4SN8AF0AcfcASwlfMQ==
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ id                    = "59832568354264842969338578310770525750" -> (known after apply)
      ~ ready_for_renewal     = false -> true
      ~ validity_end_time     = "2023-03-05T22:22:23.609706936Z" -> (known after apply)
      ~ validity_start_time   = "2022-03-05T22:22:23.609706936Z" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ subject {
          ~ organization   = "Atlantis" -> "Pritunl" # forces replacement
          - street_address = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 6 to add, 0 to change, 3 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on providers.tf line 12, in provider "digitalocean":
  12:   version = ">=1.5.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](https://wayofthesys.com/lock?id=autotune%252Fpritunl-k8s-tf-do%252Fterraform%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/atlantis`
</details>
Plan: 6 to add, 0 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
